//
//  LevelData.swift
//  SmokingTimer
//
//  Created by 神野成紀 on 2020/07/19.
//  Copyright © 2020 神野成紀. All rights reserved.
//

import Foundation

struct SystemData {
    static let systemMenu = [["SYSTEM", "system"],["LEVEL", "Level.1", "Level.2", "Level.3", "Level.4", "Level.5", "Level.6", "Level.7"]]
    static let levelConditions = ["ニコチンによって収縮していた血管が元に戻り、血圧・脈拍が正常化を始め、体温も元に戻ります、この時間からニコチンの減少によって体がタバコを求め始め、集中力の低下、イライラなどの禁断症状が起こり始めます。"
        ,"タバコによって増加していた血液中の一酸化炭素が減少し、酸素濃度が上昇し、酸素濃度が高まることで呼吸が楽になります。仕事の終わりや食事後など喫煙が生活の一部となっていた人は、この段階から禁断症状との戦いが始まります。"
        ,"タバコによって増加していた血液中の一酸化炭素が正常に戻ります。肺の浄化作用が始まり血圧が正常化することで、心臓発作の危険性も低下していきます。禁煙から24時間経つ頃から離脱症状がもっとも辛くなる期間が始まります。「昨日、一日我慢できたのだから」「もう一日、頑張ろう」。"
        ,"タバコによってうまく機能していなかった嗅覚や味覚、胃の働きの正常化が始まります。臭いや味がはっきりとわかるようになり、ご飯がとても美味しく感じるようになります。食欲増加により、ついつい食べ過ぎによる体重増加に注意が必要です。"
        ,"肺活量や気管支の機能が回復し、運動機能が大きく回復しています。試しにランニングなどの運動をしてみると、運動機能の回復が実感できます。ニコチンが体内から完全に抜けきり離脱症状も緩和されてきます。この離脱症状を乗り切ればタバコを吸いたいという欲求とお別れすることができます。明るい未来のために、離脱症状を乗り切りましょう。"
        ,"ニコチンによって低下していた睡眠の質が改善し始めます。アセチルコリンと呼ばれる神経伝達物質の機能が正常化し、質の高い睡眠をとれるようになってきます。ぐっすり寝れて、寝起きもよくなります。"
        ,"循環機能が回復し、心臓・血管が回復します。冷え性だった人も手足の冷えをあまり感じなくなってきます。喫煙によって傷んでいた肌が改善してきます。肌のハリ・ツヤ・透明感が出てきます。"]
    
}
